In [1]:
import pandas as pd

In [2]:
pwd

'C:\\MyStuff\\Ddrive\\Tensorflow\\Tensorflow-Bootcamp\\crash-course'

In [8]:
df = pd.read_csv('salaries.csv')

In [9]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [12]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [15]:
df[['Salary', 'Name']]

   Salary    Name
0   50000    John
1  120000   Sally
2   80000  Alyssa

for some statistics about the data in table

In [17]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000